{
  "name": "Damian Barzola",
  "social": {
    "linkedin": "https://www.linkedin.com/in/damianbarzola/",
    "github": "https://github.com/damianbarzola",
    "email": "mailto:damianebarzola@example.com"
  },
  "profession": "Ingeniero en sistemas de información",
  "copyright": "Todos los derechos reservados",
  "menu": {
    "profile": "Perfil Profesional",
    "experience": "Experiencia Laboral",
    "education": "Formación",
    "projects": "Proyectos"
  },
  "about": "<p>Ingeniero en Sistemas de Información con experiencia en análisis de datos, desarrollo de software y trabajo en equipo. He adquirido y perfeccionado estas habilidades a través de una sólida formación académica y una variedad de proyectos personales y profesionales.</p><p>Me destaco por ser una persona responsable, comprometida y perseverante, siempre en búsqueda de nuevos desafíos y oportunidades de aprendizaje para seguir creciendo tanto a nivel técnico como profesional.</p>",
  "experience": [
    {
      "company": "Ingeniería Boggio / Trini Talkbot",
      "position": "Desarrollador de software",
      "period": "Enero 2022 - Actualidad",
      "description": "<p><u>Migración de arquitectura:</u> Transición de una aplicación monolítica en Python Flask hacia una arquitectura moderna basada en un backend API desarrollado con Flask y un frontend PWA desarrollado con React.js. Mejorando la escalabilidad, robustez y mantenibilidad del proyecto.        </p>        <p> <u>Desarrollo continuo y mantenimiento:</u> Desarrollo y mantenimiento continuo de nuevas funcionalidades del proyecto Trini Talkbot, especializado en la creación y gestión de chatbots. Incluye, entre otras, el sistema de chat en tiempo real, la creación de un tablero de analíticas interactivo para la visualización de datos clave, la sección de conectores para integrarse con diversos servicios, y la sección de campañas para enviar múltiples mensajes a distintos contactos.        </p>        <p> <u>Implementación de pruebas automatizadas:</u> Creación de un sistema de pruebas automatizadas, mejorando la calidad del código.        </p>        <p> <u>Diseño y UI/UX:</u> Diseño y maquetación de la interfaz de usuario, mejorando la usabilidad y la estética general de la aplicación.</p>"
    }
  ],
  "education": [
    {
      "institution": "Universidad Tecnológica Nacional",
      "degree": "Ingeniería en Sistemas de Información",
      "period": "2017 - 2023",
      "location": "Rosario, Argentina"
    }
  ],
  "projects": [
    {
      "name": "Costos App",
      "description": "Aplicación web para la gestión de costos de producción de una empresa. Permite llevar un registro de los costos de los productos, calcular el costo de producción y obtener informes detallados de los costos de la empresa.",
      "technologies": ["next", "mui", "javascript", "tailwind"],
      "web": "https://costos-app.vercel.app/",
      "imageKey": "costosApp",
      "repo": "https://github.com/damianbarzola/trini-talkbot"
    },
    {
      "name":"Cine App",
      "description":"Aplicación web para la gestión de una cartelera de cine. Permite visualizar las películas en cartel, ver los detalles de cada película y realizar reservas de entradas.",
      "technologies":["react", "javascript","redux", "bootstrap", "java", "spring","mysql"],
      "web":"https://cine-app.vercel.app/",
      "imageKey":"cineApp",
      "repo":""
    },
    {
      "name":"Fletes App",
      "description":"Aplicación web para la gestión de fletes de una empresa de transporte. Permite llevar un registro de los fletes realizados, calcular el costo de los fletes y obtener informes detallados de los fletes de la empresa.",
      "technologies":["react", "javascript","redux", "express", "typescript", "spring","mysql"],
      "web":"https://fletes-app.vercel.app/",
      "imageKey":"fletesApp",
      "repo":""
    },{
      "name":"Classless css",
      "description":"Librería de estilos CSS sin clases. Permite aplicar estilos a los elementos HTML sin la necesidad de utilizar clases, simplificando el desarrollo y mejorando la legibilidad del código.",
      "technologies":["css"],
      "web":"https://damianbarzola.github.io/classless-css/",
      "imageKey":"classlessCss",
      "repo":""
    }
  ],
  "buttons": {
    "web": "Sitio web",
    "code": "Código"
  }
}
